#1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

a = str('dasdfsd')
b = int(7867)
#c = dict{“name”: “Вася”, “age”: 10}
c = complex(3454, 844)
print(type(a), type(b), type(c))
